Revit 2027 API
ParameterUtils.GetAllBuiltInParameters Method
 Gets the identifiers of all built-in parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ForgeTypeId> GetAllBuiltInParameters()
Public Shared Function GetAllBuiltInParameters As IList(Of ForgeTypeId)
public:
static IList<ForgeTypeId^>^ GetAllBuiltInParameters()
static member GetAllBuiltInParameters : unit -> IList<ForgeTypeId>
Return Value
IList<ForgeTypeId>
 The built-in parameter identifiers.
See Also
Reference
ParameterUtils Class
Autodesk.Revit.DB Namespace